基于DM3730的远程视频监控小车的硬件设计方案参考
--------------------------------

### 硬件平台主要组成部件
-------------------------------
- DM3730核心板， 采用EMA公司的SOM3730核心板
- 功能底板，用于连接SD卡，USB摄像头和USB无线网卡等外设和小车控制平台等
- 基于MSP430G2553的小车控制平台, 使用TI的LaunchPad mini开发板，用于采集传感器数据和小车和摄像头的位置控制
- 小车平台驱动部分
    - 小车移动控制使用四轮驱动，所以需要使用一个4路电机驱动模块
    - 摄像头位置控制，使用一个舵机+云台的方式，所以需要一个舵机控制接口
- 电源部分，使用三电芯的锂电池11.1V，一般采用航模电池，给其他模块供电还需用开关降压/稳压模块降压至5~6V
    - 主控板供电，电路设计参考EVM3730开发板的设计
    - LaunchPad供电，5V输入，所以可以与主控板采用一路电源
    - 小车电机驱动模块可直接使用电池供电，具体参考电机驱动的电路设计
    - 传感器供电，大部分传感器使用5v或3.3v供电，如使用功耗大的传感器需单独再加一级稳压模块

### 各部分具体说明
----------------------------
#### SOM3730核心板
![SOM3730核心板图片](http://snial.qiniudn.com/SOM3730.jpg)

- SOM3730的具体参数规格参见文档 [SOM3730产品规格书.pdf](http://snial.qiniudn.com/SOM3730%E8%A7%84%E6%A0%BC%E4%B9%A6-%E5%B9%BF%E5%B7%9E%E8%8B%B1%E7%A0%81%E4%BF%A1%E6%81%AF%E7%A7%91%E6%8A%80%E6%9C%89%E9%99%90%E5%85%AC%E5%8F%B8.pdf)
- EMA公司的DM3730核心板有至少三个版本，分别是SOM35X-B2, SOM37X-A1, SOM37X-B2, 其主要区别在于SOM35X主控为OMAP35X，SOM37X主控为AM/DM37X，而SOM37X-A1和SOM37X-B2的区别主要在于核心板上的电源管理芯片，前者为TPS65930，后者为TPS65951为前者的升级版，还有就是核心板底座的部分引脚信号有差异，这几个版本具体有哪些差异及底座引脚信号的定义请参看文档 [SOM37X User Manual.pdf](http://snial.qiniudn.com/SOM37X%20User%20Manual.pdf) （**NOTE**: 我们项目目前使用的是`SOM37X-A1`）
- 要使用这块核心板进行二次开发在硬件上还需要知道一些关于它参数
    - 接口尺寸的参数，以便进行底板PCB设计，这些参数参看文档 [SOM3X_Mechanical.pdf](http://snial.qiniudn.com/SOM3X_Mechanical.pdf) 还有4个共240PIN的B2B接插件的尺寸 [0.5板对板公座.pdf](http://snial.qiniudn.com/0.5%E6%9D%BF%E5%AF%B9%E6%9D%BF%E5%85%AC%E5%BA%A7.pdf), [0.5板对板母座.pdf](http://snial.qiniudn.com/0.5%E6%9D%BF%E5%AF%B9%E6%9D%BF%E6%AF%8D%E5%BA%A7.pdf)
    - 电源、复位、启动相关设计，参考文档[SOM37 Hardware Design Guide.pdf](http://snial.qiniudn.com/SOM37%20Hardware%20Design%20Guide.pdf)第4、5两小节。
- 在具体设计过程中，最主要参看这两个文档，[SOM37X User Manual.pdf](http://snial.qiniudn.com/SOM37X%20User%20Manual.pdf) 和我们目前正在使用的EVM3730开发板的原理图[EVM3530_B3.pdf](http://snial.qiniudn.com/EVM3530_B3.pdf)，这块开发板有些组员之前也看到过
![EVM3730](http://snial.qiniudn.com/EVM3730.jpg)
可以看到上面一大堆接口是我们项目用不上的，而且面积是有点太大了哈，装到小车上那还不是丑到家了，这也是为什么我们尽可能要开自己的底板的一个原因哈。到时候具体设计电路和画板的时候肯定会参考这块板子哈，毕竟用的是一样的核心板，当然也可以参考一些其他开源项目的板子设计，比如BeagleBoard-Black，OpenOmapBoard等。

#### 底板/主板设计
关于底板的设计，我只能说下目前我们项目必须用到的一些功能模块，也就是说在底板设计中有哪些硬件接口必须要有：
- 首先当然是最主要的几个两个部分
    - 核心板用到的B2B插座，要`注意:`它这个插座很奇怪，一般情况下，是要么核心板全是公座或母座，底板则对应是母座或公座，它这个确是这样，核心板上四个座子分部在板子两边，一边是公座，一边是母座。
    - 电源，核心板上有一个专门给DM3730供电的电源管理芯片`TPS65930`，当然它在这里的作用还不只是提供电源管理和供电， 它实则还是一个与DM3730配套的外设扩展设备，它带有LED驱动器、键盘控制器和USB控制器，可用于产生PWM信号，还有一个硬件音频编解码器，另外还用于GPIO扩展，总之非常强大，功能已经远超很多单片机了。核心板引出的很多信号引脚，实际都是从TPS65930上引出的。它控制着核心板的上电顺序和复位操作等，所以做硬件设计`一定`先了解一下它，好在它已经集成在核心板上了，我们不用关心它本身的硬件设计，只需关心从它引出的那些信号线的处理（包括与前一级电源的连接）。我们要重点关心的是为主板上其他外设供电和为核心板供电(准确的说是为TPS65930供电)的第一级电源设计，如果关于这一点没啥概念的话，请参看前面给出的EVM3730开发板的原理图，而且一定要`注意`我们的板子是要用`电池供电`的，但同时我们也要保留一个用电源适配器供电的接口（插座，microUSB或那种方口USB的都行）。
- USB扩展接口，1个肯定不够，至少两个，一个插USB摄像头，一个USB无线网卡，原本不想要USB无线网卡，使用在板子上集成wifi模块的方式，但谁让它可以避免很多麻烦呢，于是就用它了，它也避免了很多软件开发上的麻烦。
- TTL串口，用于调试时打印调试信息，我们就不要再用那什么RS232的接口了，可以留两个Uart的接口，都用TTL。
- 以太网接口，以为软件开发时，不可能直接就用无线吧，要先把网络弄通还是要先要用有线。
- SD卡插槽，或者mircoSD也可以，用来作为系统的存储设备，挂在文件系统这些。
- I2C接口，我们项目目前采用的方案就是用I2C与launghpad通信，以达到控制小车和采集传感器数据的目的，而不是直接用DM3730在linux之上来进行控制，我之前汇报时也已经解释过，这样可以减轻很多软件开发的负担，也更容易后期功能扩展。
- SPI通信，虽然目前项目没有到SPI通信的设备，但为了后期扩展需要还是应保留SPI的接口
- 按键，用于实现关机，复位重启，开机操作，现在我们用的这块开发板以为一些位置原因，只能实现复位操作，不能手动开机或者关机，每次开关机都是通过拔插电源线实现的，相当麻烦，而且不安全。
上面就介绍了一些完成我们项目最基本功能所要用到的一些硬件模块和接口，当然我们希望以后能实现更多功能，这就需要做硬件设计的同学有一些自己的思考或者和项目组内讨论之后确定了，是否再增加一些额外的功能模块。在后面具体的硬件设计过程中即使目前只实现基本功能还是要为后期的可扩展性做一些考虑，留出一些必要的接口，不要设计出的板子只能用一次，以后每次小升级都要重新做板子，那就不太好了。

#### 小车平台硬件设计
小车平台主要要解决的是四路电机驱动和一些传感器的单独供电，我以前开过两块L298N组成的四路电机驱动，但设计上有很多瑕疵，比如没有使用光耦隔离，使得有刷电机产生的很多噪声干扰，可能影响下一级电源进而影响到主板和传感器，且功耗很大发热很厉害，这些都是需要注意的。所以我们这次最好不用L298N了，可以选用TI的电机驱动芯片进行设计，并将第一级（也就是直接和电池连接的这一级）开关稳压/降压模块集成在一起，用于给下一级提供稳定的5V供电。如果可能再加上锂电池管理芯片和锂电池充电电路，免去每次充电的麻烦，并可以监控电池用电情况。

#### 整体硬件设计概览图
![硬件整体](http://snial.qiniudn.com/%E7%A1%AC%E4%BB%B6%E6%95%B4%E4%BD%93%E5%9B%BE.png)
